cfeltch537/psoc6-realtime-processing/BLE_RTC_IMU.cydsn/CE218138_BLE_Thermometer_RTOS01.cydsn/Generated_Source/PSoC6/BLE_config.c
#endif  /* (CY_BLE_MODE_PROFILE) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

#if(CY_BLE_GATT_ROLE_SERVER)
static const cy_stc_ble_gatts_t cy_ble_gatts =
{
    0x0008u,    /* Handle of the GATT service */
    0x000Au,    /* Handle of the Service Changed characteristic */
    0x000Bu,    /* Handle of the Client Characteristic Configuration descriptor */
};
static const cy_stc_ble_gaps_t cy_ble_gaps =
{
    0x0001u,    /* Handle of the GAP service */
    0x0003u,    /* Handle of the Device Name characteristic */
    0x0005u,    /* Handle of the Appearance characteristic */
    0x0007u,    /* Handle of the Peripheral Preferred Connection Parameters characteristic */
    CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the Central Address Resolution characteristic */
    CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE, /* Handle of the Resolvable Private Address Only characteristic */
};
static uint8_t cy_ble_attValues[0x92u] = {
    /* Device Name */
    (uint8_t)'B', (uint8_t)'L', (uint8_t)'E', (uint8_t)' ', (uint8_t)'T', (uint8_t)'h', (uint8_t)'e', (uint8_t)'r',
(uint8_t)'m', (uint8_t)'o', (uint8_t)'m', (uint8_t)'e', (uint8_t)'t', (uint8_t)'e', (uint8_t)'r', 

    /* Appearance */
    0x00u, 0x03u, 

    /* Peripheral Preferred Connection Parameters */
    0x06u, 0x00u, 0x28u, 0x00u, 0x00u, 0x00u, 0xE8u, 0x03u, 

    /* Service Changed */
    0x00u, 0x00u, 0x00u, 0x00u, 

    /* Temperature Measurement */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 

    /* Temperature Type */
    0x04u, 

    /* Intermediate Temperature */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 

    /* Measurement Interval */
    0x00u, 0x00u, 

    /* Valid Range */
    0x00u, 0x00u, 0x00u, 0x00u, 

    /* Manufacturer Name String */
    (uint8_t)'C', (uint8_t)'y', (uint8_t)'p', (uint8_t)'r', (uint8_t)'e', (uint8_t)'s', (uint8_t)'s', (uint8_t)' ',
(uint8_t)'S', (uint8_t)'e', (uint8_t)'m', (uint8_t)'i', (uint8_t)'c', (uint8_t)'o', (uint8_t)'n', (uint8_t)'d',
(uint8_t)'u', (uint8_t)'c', (uint8_t)'t', (uint8_t)'o', (uint8_t)'r', 

    /* Model Number String */
    (uint8_t)'1', (uint8_t)'.', (uint8_t)'0', 

    /* Serial Number String */
    (uint8_t)'*', (uint8_t)'*', 

    /* Hardware Revision String */
    (uint8_t)'C', (uint8_t)'Y', (uint8_t)'8', (uint8_t)'C', (uint8_t)'K', (uint8_t)'I', (uint8_t)'T', (uint8_t)'-',
(uint8_t)'0', (uint8_t)'6', (uint8_t)'2', (uint8_t)'-', (uint8_t)'B', (uint8_t)'L', (uint8_t)'E', 

    /* Firmware Revision String */
    (uint8_t)'1', (uint8_t)'.', (uint8_t)'0', 

    /* Software Revision String */
    (uint8_t)'P', (uint8_t)'S', (uint8_t)'o', (uint8_t)'C', (uint8_t)' ', (uint8_t)'C', (uint8_t)'r', (uint8_t)'e',
(uint8_t)'a', (uint8_t)'t', (uint8_t)'o', (uint8_t)'r', (uint8_t)' ', (uint8_t)'4', (uint8_t)'.', (uint8_t)'2', 

    /* System ID */
    0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 

    /* IEEE 11073-20601 Regulatory Certification Data List */
    0x00u, 

    /* PnP ID */
    0x01u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 0x00u, 

    /* Acc */
    0x00u, 0x00u, 0x00u, 0x00u, 

    /* Characteristic User Description */
    (uint8_t)'A', (uint8_t)'c', (uint8_t)'c', (uint8_t)' ', (uint8_t)'a', (uint8_t)'n', (uint8_t)'d', (uint8_t)' ',
(uint8_t)'G', (uint8_t)'y', (uint8_t)'r', (uint8_t)'o', (uint8_t)' ', (uint8_t)'(', (uint8_t)'X', (uint8_t)',',
(uint8_t)'Y', (uint8_t)',', (uint8_t)'Z', (uint8_t)')', 

};
#if(CY_BLE_GATT_DB_CCCD_COUNT != 0u)
static uint8_t cy_ble_attValuesCCCD[CY_BLE_GATT_DB_CCCD_COUNT];
#endif /* CY_BLE_GATT_DB_CCCD_COUNT != 0u */

static const uint8_t cy_ble_attUuid128[][16u] = {
    /* IMU */
    { 0x3Au, 0x37u, 0xC7u, 0x23u, 0x39u, 0x3Fu, 0x9Fu, 0x9Fu, 0x26u, 0x4Bu, 0xCAu, 0x6Fu, 0x57u, 0xE5u, 0xDEu, 0xB6u },
    /* Acc */
    { 0x2Eu, 0x65u, 0xE6u, 0x7Eu, 0xD5u, 0xCBu, 0x19u, 0xAFu, 0x14u, 0x46u, 0x28u, 0xD7u, 0xB7u, 0x0Cu, 0xE2u, 0x28u },
};

static cy_stc_ble_gatts_att_gen_val_len_t cy_ble_attValuesLen[0x1Bu] = {
    { 0x000Fu, (void *)&cy_ble_attValues[0] }, /* Device Name */
    { 0x0002u, (void *)&cy_ble_attValues[15] }, /* Appearance */
    { 0x0008u, (void *)&cy_ble_attValues[17] }, /* Peripheral Preferred Connection Parameters */
    { 0x0004u, (void *)&cy_ble_attValues[25] }, /* Service Changed */
    { 0x0002u, (void *)&cy_ble_attValuesCCCD[0] }, /* Client Characteristic Configuration */
    { 0x0005u, (void *)&cy_ble_attValues[29] }, /* Temperature Measurement */
    { 0x0002u, (void *)&cy_ble_attValuesCCCD[2] }, /* Client Characteristic Configuration */
    { 0x0001u, (void *)&cy_ble_attValues[34] }, /* Temperature Type */
    { 0x0005u, (void *)&cy_ble_attValues[35] }, /* Intermediate Temperature */
    { 0x0002u, (void *)&cy_ble_attValuesCCCD[4] }, /* Client Characteristic Configuration */
    { 0x0002u, (void *)&cy_ble_attValues[40] }, /* Measurement Interval */
    { 0x0002u, (void *)&cy_ble_attValuesCCCD[6] }, /* Client Characteristic Configuration */
    { 0x0004u, (void *)&cy_ble_attValues[42] }, /* Valid Range */
    { 0x0015u, (void *)&cy_ble_attValues[46] }, /* Manufacturer Name String */
    { 0x0003u, (void *)&cy_ble_attValues[67] }, /* Model Number String */
    { 0x0002u, (void *)&cy_ble_attValues[70] }, /* Serial Number String */
    { 0x000Fu, (void *)&cy_ble_attValues[72] }, /* Hardware Revision String */
    { 0x0003u, (void *)&cy_ble_attValues[87] }, /* Firmware Revision String */
    { 0x0010u, (void *)&cy_ble_attValues[90] }, /* Software Revision String */
    { 0x0008u, (void *)&cy_ble_attValues[106] }, /* System ID */
    { 0x0001u, (void *)&cy_ble_attValues[114] }, /* IEEE 11073-20601 Regulatory Certification Data List */
    { 0x0007u, (void *)&cy_ble_attValues[115] }, /* PnP ID */
    { 0x0010u, (void *)&cy_ble_attUuid128[0] }, /* IMU UUID */
    { 0x0010u, (void *)&cy_ble_attUuid128[1] }, /* Acc UUID */
    { 0x0004u, (void *)&cy_ble_attValues[122] }, /* Acc */
    { 0x0002u, (void *)&cy_ble_attValuesCCCD[8] }, /* Client Characteristic Configuration */
    { 0x0014u, (void *)&cy_ble_attValues[126] }, /* Characteristic User Description */
};

static const cy_stc_ble_gatts_db_t cy_ble_gattDB[0x30u] = {
    { 0x0001u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0007u, {{0x1800u, NULL}}                           },
    { 0x0002u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0003u, {{0x2A00u, NULL}}                           },
    { 0x0003u, 0x2A00u /* Device Name                         */, 0x01020001u /* rd    */, 0x0003u, {{0x000Fu, (void *)&cy_ble_attValuesLen[0]}} },
    { 0x0004u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0005u, {{0x2A01u, NULL}}                           },
    { 0x0005u, 0x2A01u /* Appearance                          */, 0x01020001u /* rd    */, 0x0005u, {{0x0002u, (void *)&cy_ble_attValuesLen[1]}} },
    { 0x0006u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0007u, {{0x2A04u, NULL}}                           },
    { 0x0007u, 0x2A04u /* Peripheral Preferred Connection Par */, 0x01020001u /* rd    */, 0x0007u, {{0x0008u, (void *)&cy_ble_attValuesLen[2]}} },
    { 0x0008u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x000Bu, {{0x1801u, NULL}}                           },
    { 0x0009u, 0x2803u /* Characteristic                      */, 0x00200001u /* ind   */, 0x000Bu, {{0x2A05u, NULL}}                           },
    { 0x000Au, 0x2A05u /* Service Changed                     */, 0x01200000u /* ind   */, 0x000Bu, {{0x0004u, (void *)&cy_ble_attValuesLen[3]}} },
    { 0x000Bu, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x000Bu, {{0x0002u, (void *)&cy_ble_attValuesLen[4]}} },
    { 0x000Cu, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x0018u, {{0x1809u, NULL}}                           },
    { 0x000Du, 0x2803u /* Characteristic                      */, 0x00200001u /* ind   */, 0x000Fu, {{0x2A1Cu, NULL}}                           },
    { 0x000Eu, 0x2A1Cu /* Temperature Measurement             */, 0x01200000u /* ind   */, 0x000Fu, {{0x0005u, (void *)&cy_ble_attValuesLen[5]}} },
    { 0x000Fu, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x000Fu, {{0x0002u, (void *)&cy_ble_attValuesLen[6]}} },
    { 0x0010u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0011u, {{0x2A1Du, NULL}}                           },
    { 0x0011u, 0x2A1Du /* Temperature Type                    */, 0x01020001u /* rd    */, 0x0011u, {{0x0001u, (void *)&cy_ble_attValuesLen[7]}} },
    { 0x0012u, 0x2803u /* Characteristic                      */, 0x00100001u /* ntf   */, 0x0014u, {{0x2A1Eu, NULL}}                           },
    { 0x0013u, 0x2A1Eu /* Intermediate Temperature            */, 0x01100000u /* ntf   */, 0x0014u, {{0x0005u, (void *)&cy_ble_attValuesLen[8]}} },
    { 0x0014u, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x0014u, {{0x0002u, (void *)&cy_ble_attValuesLen[9]}} },
    { 0x0015u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0018u, {{0x2A21u, NULL}}                           },
    { 0x0016u, 0x2A21u /* Measurement Interval                */, 0x01020001u /* rd    */, 0x0018u, {{0x0002u, (void *)&cy_ble_attValuesLen[10]}} },
    { 0x0017u, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x0017u, {{0x0002u, (void *)&cy_ble_attValuesLen[11]}} },
    { 0x0018u, 0x2906u /* Valid Range                         */, 0x01020001u /* rd    */, 0x0018u, {{0x0004u, (void *)&cy_ble_attValuesLen[12]}} },
    { 0x0019u, 0x2800u /* Primary service                     */, 0x00000001u /*       */, 0x002Bu, {{0x180Au, NULL}}                           },
    { 0x001Au, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Bu, {{0x2A29u, NULL}}                           },
    { 0x001Bu, 0x2A29u /* Manufacturer Name String            */, 0x01020001u /* rd    */, 0x001Bu, {{0x0015u, (void *)&cy_ble_attValuesLen[13]}} },
    { 0x001Cu, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Du, {{0x2A24u, NULL}}                           },
    { 0x001Du, 0x2A24u /* Model Number String                 */, 0x01020001u /* rd    */, 0x001Du, {{0x0003u, (void *)&cy_ble_attValuesLen[14]}} },
    { 0x001Eu, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x001Fu, {{0x2A25u, NULL}}                           },
    { 0x001Fu, 0x2A25u /* Serial Number String                */, 0x01020001u /* rd    */, 0x001Fu, {{0x0002u, (void *)&cy_ble_attValuesLen[15]}} },
    { 0x0020u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0021u, {{0x2A27u, NULL}}                           },
    { 0x0021u, 0x2A27u /* Hardware Revision String            */, 0x01020001u /* rd    */, 0x0021u, {{0x000Fu, (void *)&cy_ble_attValuesLen[16]}} },
    { 0x0022u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0023u, {{0x2A26u, NULL}}                           },
    { 0x0023u, 0x2A26u /* Firmware Revision String            */, 0x01020001u /* rd    */, 0x0023u, {{0x0003u, (void *)&cy_ble_attValuesLen[17]}} },
    { 0x0024u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0025u, {{0x2A28u, NULL}}                           },
    { 0x0025u, 0x2A28u /* Software Revision String            */, 0x01020001u /* rd    */, 0x0025u, {{0x0010u, (void *)&cy_ble_attValuesLen[18]}} },
    { 0x0026u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0027u, {{0x2A23u, NULL}}                           },
    { 0x0027u, 0x2A23u /* System ID                           */, 0x01020001u /* rd    */, 0x0027u, {{0x0008u, (void *)&cy_ble_attValuesLen[19]}} },
    { 0x0028u, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x0029u, {{0x2A2Au, NULL}}                           },
    { 0x0029u, 0x2A2Au /* IEEE 11073-20601 Regulatory Certifi */, 0x01020001u /* rd    */, 0x0029u, {{0x0001u, (void *)&cy_ble_attValuesLen[20]}} },
    { 0x002Au, 0x2803u /* Characteristic                      */, 0x00020001u /* rd    */, 0x002Bu, {{0x2A50u, NULL}}                           },
    { 0x002Bu, 0x2A50u /* PnP ID                              */, 0x01020001u /* rd    */, 0x002Bu, {{0x0007u, (void *)&cy_ble_attValuesLen[21]}} },
    { 0x002Cu, 0x2800u /* Primary service                     */, 0x08000001u /*       */, 0x0030u, {{0x0010u, (void *)&cy_ble_attValuesLen[22]}} },
    { 0x002Du, 0x2803u /* Characteristic                      */, 0x00200001u /* ind   */, 0x0030u, {{0x0010u, (void *)&cy_ble_attValuesLen[23]}} },
    { 0x002Eu, 0x0CB7u /* Acc                                 */, 0x09200000u /* ind   */, 0x0030u, {{0x0004u, (void *)&cy_ble_attValuesLen[24]}} },
    { 0x002Fu, 0x2902u /* Client Characteristic Configuration */, 0x030A0101u /* rd,wr */, 0x002Fu, {{0x0002u, (void *)&cy_ble_attValuesLen[25]}} },
    { 0x0030u, 0x2901u /* Characteristic User Description     */, 0x01020001u /* rd    */, 0x0030u, {{0x0014u, (void *)&cy_ble_attValuesLen[26]}} },
};

#endif /* (CY_BLE_GATT_ROLE_SERVER) */

/* Default device security */
#if (CY_BLE_MODE_PROFILE) 
    cy_stc_ble_gap_auth_info_t cy_ble_authInfo[0x01u] = {

    /* Security configuration 0 */
    {
        .security = (CY_BLE_GAP_SEC_MODE_1 | CY_BLE_GAP_SEC_LEVEL_1 ), 
        .bonding = CY_BLE_GAP_BONDING_NONE, 
        .ekeySize = 0x10u, 
        .authErr = CY_BLE_GAP_AUTH_ERROR_NONE, 
        .pairingProperties = 0x01u, 
    },
};

#endif /* CY_BLE_MODE_PROFILE */

#if(CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_PERIPHERAL)

/** Initialize BLE configuration parameters structure */
static const cy_stc_ble_params_t cy_ble_params =
{
        .txPowerLevelAdv                    = CY_BLE_LL_PWR_LVL_0_DBM,
        .txPowerLevelConn                   = CY_BLE_LL_PWR_LVL_0_DBM,

        .securityIoCapability               = CY_BLE_GAP_IOCAP_DISPLAY_ONLY,
        .securityPairingMethod              = 0x00u,
    
